rework architecture section
